/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'Adguard icon' button */
"Accept" = "Hyväksy";

/* (AEService) The default message for an unknown error. */
"An unexpected error occurred. Please contact support team." = "An unexpected error occurred. Please contact support team.";

/* (AEService) Service errors descriptions */
"Attempted to convert rules to JSON while service is not started." = "Yritys muuttaa sääntöjä JSON-muotoon palvelun ollessa pois päältä";

/* (Action Extension - ActionViewController) An error which occurs if the action extension is launched before the main Adguard app. */
"Before you can use this action extension, %@ has to perform an initial configuration. Launch the main %@ app to let it do so." = "Before you can use this action extension, %1$@ has to perform an initial configuration. Launch the main %2$@ app to let it do so.";

/* (AEUIAboutController) Subject field for mail bug report */
"Bug Report" = "Virheraportti";

/* (AESFilterConverter) Error occured when checking of the result from JSON converter. */
"Can't convert rules. Unexpected error occured. Please contact support team." = "Ei voida konvertoida sääntöä. Odottamaton virhe. Ota yhteyttä tukeen.";

/* (AEService) Service errors descriptions */
"Can't initialize converter to JSON format!" = "Can't initialize converter to JSON format!";

/* (AEUIAboutController) Alert message if user have no e-mail account on device */
"Can't send bug report because no email is probably set up on your device." = "Ei voida lähettää viestiä tukitiimille, koska et ole asettanut sähköpostitiliä laitteeseesi.";

/* (AEUIAboutController) Alert message if user have no e-mail account on device */
"Can't send message to support team because you have no configured email account." = "Ei voida lähettää viestiä tukitiimille, koska et ole asettanut sähköpostitiliä laitteeseesi.";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'close icon' button */
"Cancel" = "Peruuta";

/* (AEService) Service errors descriptions */
"Cannot convert the filter rule. Rule text is invalid." = "Cannot convert the filter rule. Rule text is invalid.";

/* (AEUIUtils) User filter convertering error description. */
"Cannot convert user filter rules. One of the rules contains an error. Check the rule next to the current cursor position." = "Cannot convert user filter rules. One of the rules contains an error. Check the rule next to the current cursor position.";

/* (Action Extension - AEAUIMainController) Label on switcher. Example: 'Enable filtering on www.github.com' */
"Enable filtering on %@" = "Enable filtering on %@";

/* (Action Extension - AEAUIMainController) Error tile
   (AEUIUtils) Alert title. When converting rules process ended. */
"Error" = "Virhe";

/* (AEService) Service errors descriptions */
"Exceeded the maximum number of filter rules." = "Enimmäismäärä suodatussääntöjä ylitetty";

/* (AEService) Service errors descriptions */
"Filters cannot be loaded into Safari. Therefore, your recent changes were not applied." = "Suodattimia ei voida ladata Safariin. Tästä syystä viimeisimpiä muutoksia ei otettu käyttöön.";

/* (Action Extension - AEAUIMainController) Mail body to support team about incorrect blocking */
"Incorrect blocking on page:\n%@" = "Virheellinen esto sivulla:\n%@ ";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'munus' button */
"Less" = "Vähemmän";

/* (AEUILoadingModal) Standard message when filter conversion is performed. */
"Loading filters to Safari. Please do not turn off Adguard, the process will take no more than 30 seconds..." = "Ladataan suodattimia Safariin. Älä sulje Adguardia, prosessin ei pitäisi kestää 30 sekunttia pidempään...";

/* (Action Extension - AEAUIMainController) Mail body to support team about missed ad */
"Missed ad on page:\n%@" = "Estämätön mainos sivulla:\n%@ ";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'plus' button */
"More" = "Enemmän";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'eye icon' button */
"Preview" = "Esikatsele";

/* (Action Extension - AEAUIMainController) Mail subject to support team about incorrect blocking */
"Report Incorrect Blocking" = "Ilmoita virheellisestä estosta";

/* (Action Extension - AEAUIMainController) Mail subject to support team about missed ad */
"Report Missed Ad" = "Ilmoita estämättömästä mainoksesta";

/* (Action Extension - ActionViewController) Can't obtain hostname when starting. */
"The hostname is not obtained. Perhaps the page is not yet loaded." = "The hostname is not obtained. Perhaps the page is not yet loaded.";

/* (Action Extension - AEAUIMainController) error occurs when click on Block Element button. */
"This website security policy does not allow to launch Adguard Assistant." = "Tämän verkkosivuston turvallisuusasetukset eivät salli Adguard avustajan käynnistämistä.";

/* (Action Extension - ActionViewController) Some errors when starting. */
"Unexpected error occurred while initializing Safari action extension. Please contact Adguard support if this happens again." = "Odottamaton virhe tapahtui alustettaessa Safari-laajennusta. Ole hyvä ja ota yhteyttä Adguardin tukeen jos tämä tapahtuu uudestaan.";

/* (Action Extension - AEAUIMainController) error occurs when try turn off filtration on site. */
"You have exceeded the maximum number of the filter rules." = "Ei voida muuttaa lisätä verkko-osoitetta sallittujen listalle. Enimmäismäärä sääntöjä ylitetty.";

